Conf.Simple/src/Reports/SUI_ОтчетПоЗадачамПересчет/SUI_ОтчетПоЗадачамПересчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>SUI_ОтчетПоЗадачамПересчет</name>
  <attributes>
    <name>ТестовыйРеквизит</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Report>

Conf.Simple/src/InformationRegisters/SUI_docs_tbl_goods_delta/SUI_docs_tbl_goods_delta.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_docs_tbl_goods_delta</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>d_qtty</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_cell</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_good</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_price</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_properties</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_series</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_unit</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>price</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>use_series</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ТипТаблицы</name>
    <type>
      <types>EnumRef.SUI_ТипыТаблицДокументовОбмена</types>
    </type>
  </attributes>
  <dimensions>
    <name>sid</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>sid_doc</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>МобильноеУстройство</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/InformationRegisters/SUI_docs/SUI_docs.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_docs</name>
  <resources>
    <name>additional_details</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>barcode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>doc_date</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>doc_n</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>doc_type</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_countragents</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_warehouse</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>is_barc_flow</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>use_mark</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтролироватьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЭтоДокументАдресногоХранения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Агрегация</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>process_type</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>cells_process_type</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МобильноеУстройство</name>
    <type>
      <types>CatalogRef.Удалить_SUI_МобильныеКлиенты</types>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.SUI_СостоянияДокументовОбмена</types>
    </type>
  </attributes>
  <dimensions>
    <name>sid</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>id_doc</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НастройкаДокумента</name>
    <type>
      <types>CatalogRef.SUI_НастройкиДокументов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/Reports/SUI_ОтчетПоЗадачамПересчет/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
		
	СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	ТЗВывод = Новый ТаблицаЗначений;
	ТЗВывод.Колонки.Добавить("Период");
	ТЗВывод.Колонки.Добавить("sid");
	ТЗВывод.Колонки.Добавить("id_doc");
	ТЗВывод.Колонки.Добавить("МобильныйКлиент");
	ТЗВывод.Колонки.Добавить("id_good");
	ТЗВывод.Колонки.Добавить("id_properties");
	ТЗВывод.Колонки.Добавить("id_series");
	ТЗВывод.Колонки.Добавить("id_cell");
	ТЗВывод.Колонки.Добавить("id_unit");
	ТЗВывод.Колонки.Добавить("id_price");
	ТЗВывод.Колонки.Добавить("price");
	ТЗВывод.Колонки.Добавить("d_qtty");
	ТЗВывод.Колонки.Добавить("use_series");
	ТЗВывод.Колонки.Добавить("ТипТаблицы");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	SUI_docs_tbl_goods_deltaСрезПоследних.Период КАК Период,
	               |	SUI_docs_tbl_goods_deltaСрезПоследних.sid КАК sid,
	               |	SUI_docs.id_doc КАК id_doc,
	               |	SUI_docs_tbl_goods_deltaСрезПоследних.МобильныйКлиент КАК МобильныйКлиент,
	               |	SUI_docs_tbl_goods_deltaСрезПоследних.id_good КАК id_good,
	               |	SUI_docs_tbl_goods_deltaСрезПоследних.id_properties КАК id_properties,
	               |	SUI_docs_tbl_goods_deltaСрезПоследних.id_series КАК id_series,
	               |	SUI_docs_tbl_goods_deltaСрезПоследних.id_cell КАК id_cell,
	               |	SUI_docs_tbl_goods_deltaСрезПоследних.id_unit КАК id_unit,
	               |	SUI_docs_tbl_goods_deltaСрезПоследних.id_price КАК id_price,
	               |	СУММА(SUI_docs_tbl_goods_deltaСрезПоследних.price) КАК price,
	               |	СУММА(SUI_docs_tbl_goods_deltaСрезПоследних.d_qtty) КАК d_qtty
	               |ИЗ
	               |	РегистрСведений.SUI_docs_tbl_goods_delta.СрезПоследних КАК SUI_docs_tbl_goods_deltaСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.SUI_docs КАК SUI_docs
	               |		ПО SUI_docs_tbl_goods_deltaСрезПоследних.sid_doc = SUI_docs.sid
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	SUI_docs_tbl_goods_deltaСрезПоследних.sid,
	               |	SUI_docs_tbl_goods_deltaСрезПоследних.МобильныйКлиент,
	               |	SUI_docs_tbl_goods_deltaСрезПоследних.Период,
	               |	SUI_docs_tbl_goods_deltaСрезПоследних.id_cell,
	               |	SUI_docs_tbl_goods_deltaСрезПоследних.id_series,
	               |	SUI_docs_tbl_goods_deltaСрезПоследних.id_unit,
	               |	SUI_docs_tbl_goods_deltaСрезПоследних.id_properties,
	               |	SUI_docs_tbl_goods_deltaСрезПоследних.id_good,
	               |	SUI_docs_tbl_goods_deltaСрезПоследних.id_price,
	               |	SUI_docs.id_doc";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выгрузить();
	
	Для Каждого СтрокаВыгрузки Из ВыборкаДетальныеЗаписи Цикл 
		
		СтруктураПриемник = Новый Структура; 
		
		SUI_ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаВыгрузки,СтруктураПриемник);   		
		SUI_ИнтеграцияВКонфигурацию.ВосстановитьСсылкиИдентификаторовSimple(СтруктураПриемник, ,Ложь);  
				
		ЗаполнитьЗначенияСвойств(ТЗВывод.Добавить(), СтруктураПриемник);
		
	КонецЦикла;
		
	Настройки = КомпоновщикНастроек.ПолучитьНастройки(); 
 
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных; 
 
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);	
	
	ВнешнийНаборДанных = Новый Структура("ПримерТаблицыЗначений", ТЗВывод); 
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных; 
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешнийНаборДанных, ДанныеРасшифровки); 
	
	ДокументРезультат.Очистить();
	
 	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент; 
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат); 
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
